tsung_tests/services/tsung_c_e_d_service.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="20" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="20" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="20" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="20" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="20" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <option name="file_server" id="users" value="users.csv"/>
  </options>

  <sessions>
    <session name="main" type="ts_http" weight="1">
      <transaction name="create-service">
        <setdynvars sourcetype="file" fileid="users" delimiter="," order="iter">
          <var name="username" />
          <var name="password" />
        </setdynvars>

        <setdynvars sourcetype="random_string" length="15"> <var name="service_suffix" /> </setdynvars>
        <setdynvars sourcetype="random_string" length="15"> <var name="service_suffix_2" /> </setdynvars>        

        <request> <http url='/' version='1.1' method='GET'></http> </request>
        <request> <http url='/login' version='1.1' method='GET'></http> </request>

        <thinktime value="2" random="true"></thinktime>
        <request subst="true">
          <http 
            url="/login" 
            method="POST" 
            version="1.1" 
            contents="user[username]=%%_username%%&amp;
                user[password]=%%_password%%&amp;
                commit=Log in" 
            content_type="application/x-www-form-urlencoded" />
        </request>

        <request> <http url='/' version='1.1' method='GET'></http> </request>
        
        <!-- click create a service -->
        <request> <http url="/services/new" method="GET" version="1.1" /> </request>

        <!-- Wait while user fills out 'new services' form -->
        <thinktime value="3" random="true"></thinktime>

        <!-- submit 'new services' form -->
        <request subst="true">
          <dyn_variable name="services_redirect" re="[Ll]ocation: (.*)\r" />
          <http 
            url="/services/new" 
            method="POST" 
            version="1.1" 
            contents="service[title]=Dog Grooming by %%_username%%days&amp;
                      service[description]Dog Grooming %%_service_suffix%%&amp;
                      commit=Create+Service"
            content_type="application/x-www-form-urlencoded" />
        </request>

        <!-- follow redirect -->
        <request subst="true">　<http url="%%_services_redirect%%" method="GET" version="1.1" />　</request>
        <request subst="true"> <http url="%%_services_redirect%%/edit" method="GET" version="1.1" /> </request>
        
        <!-- submit 'edit services' form -->
        <thinktime value="3" random="true"></thinktime>
        <request subst="true">
          <http 
            url="%%_services_redirect%%/edit" 
            method="POST" 
            version="1.1" 
            contents="service[title]=Dog Grooming by %%_username%%days&amp;
                      service[description]=Dog Grooming %%_service_suffix_2%%&amp;
                      commit=Create+Service"
            content_type="application/x-www-form-urlencoded" />
        </request>
        <request subst="true"> <http url="%%_services_redirect%%" method="GET" version="1.1" /> </request>
        
        <!-- Delete service -->
        <request subst="true">
          <http 
            url="%%_services_redirect%%" 
            method="POST" 
            version="1.1" 
            contents="_method=delete" 
            content_type="application/x-www-form-urlencoded" />
        </request>

        <request> <http url="/services" method="GET" version="1.1" /> </request>

        <!-- Log out -->
        <request>
          <http 
            url="/logout" 
            method="POST" 
            version="1.1" 
            contents="_method=delete" 
            content_type="application/x-www-form-urlencoded" />
        </request>

      </transaction>
    </session>
  </sessions>
</tsung>